In [16]:
import pandas as pd

In [17]:
df = pd.DataFrame({
    "A" : [1, 2, np.nan],
    "B" : [4, np.nan, np.nan],
    "C" : [7, 1, 3] 
})
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [18]:
df.dropna(axis=0)

     A    B  C
0  1.0  4.0  7

In [19]:
df.dropna(axis=1)

   C
0  7
1  1
2  3

In [20]:
df.dropna(axis=1, thresh=3)

   C
0  7
1  1
2  3

In [21]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  7
1  2.0  1
2  NaN  3

In [22]:
df.dropna(axis=1, thresh=1)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [23]:
df.dropna(axis=0, thresh=3)

     A    B  C
0  1.0  4.0  7

In [24]:
df.dropna(axis=0, thresh=2)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1

In [25]:
df.dropna(axis=0, thresh=1)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [26]:
df.fillna("TEXTANDO")

          A         B  C
0       1.0       4.0  7
1       2.0  TEXTANDO  1
2  TEXTANDO  TEXTANDO  3

In [27]:
df.fillna(0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  1
2  0.0  0.0  3

In [28]:
df["B"].fillna("b")

0    4.0
1      b
2      b
Name: B, dtype: object

In [29]:
df.ffill()

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  1
2  2.0  4.0  3